import { Career } from "./types";

export const careers: Career[] = [
  {
    company: "(주)더블유컨셉코리아",
    role: "Web Publisher",
    period: "2019.06 - 재직 중",
    description: [
      "B2C 전시 프론트 UI/UX 고도화: React 환경 기반의 e-커머스 서비스 마크업 개편 및 컴포넌트 단위의 유연한 반응형 UI 개발",
      "UI 컴포넌트 모듈화 및 사용성 최적화: 공통 UI 컴포넌트 설계 및 다양한 모바일/OS 기기에 맞춘 크로스 브라우징 대응",
      "B2B 백오피스 및 프로모션 시스템 구축: 사내 운영 효율화를 위한 데이터 시각화 화면 및 컴포넌트 조립형(CMS) 프로모션 UI 구축",
      "UI 컴포넌트화 및 크로스 직군 협업: 기획/디자인 부서와의 긴밀한 소통을 바탕으로 일관된 UI 가이드라인을 마크업에 적용하고 화면 접근성 향상",
    ],
  },
  {
    company: "(주)나인파이브주식회사",
    role: "Web Publisher",
    period: "2016.08 - 2018.03",
    description: [
      "대규모 반응형 웹 마크업: 삼성전자(삼성닷컴) 프로모션 및 상품 상세 페이지 등 다양한 디바이스에 대응하는 크로스 플랫폼 UI 개발",
      "글로벌 기업 B2B/R&D 웹사이트 리뉴얼: 삼성반도체 글로벌 닷컴 운영 및 한화큐셀 R&D 웹사이트 신규 개편 프로젝트 마크업 전담",
      "웹 접근성 및 마크업 품질 최적화: 웹 표준 지침을 준수한 고품질 UI 구현 및 시맨틱 마크업을 통한 검색 노출(SEO) 효율 증대",
    ],
  },
];
